Ran Plan for dir: `terragrunt/kubernetes/longhorn` workspace: `terragrunt_kubernetes_longhorn`

<details><summary>Show Output</summary>

```diff
Authenticated

01:01:10.602 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/NFPAgtL6WNWAODeglJb5NNPu8VQ/pvfWVn-ytiYF5gbqPLvVFuxkQbg
01:01:10.642 INFO   tofu: Initializing the backend...
01:01:10.911 INFO   tofu: Initializing provider plugins...
01:01:10.911 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
01:01:11.097 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
01:01:11.243 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
01:01:11.415 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
01:01:11.548 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
01:01:11.653 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
01:01:11.755 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
01:01:11.872 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
01:01:12.036 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
01:01:12.046 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
01:01:12.078 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
01:01:12.111 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
01:01:12.131 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
01:01:12.165 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
01:01:12.179 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
01:01:12.252 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
01:01:12.252 INFO   tofu: OpenTofu has been successfully initialized!
01:01:13.287 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
01:01:13.287 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
01:01:13.287 STDOUT tofu:   ~ update in-place
01:01:13.287 STDOUT tofu: OpenTofu will perform the following actions:
01:01:13.288 STDOUT tofu:   # helm_release.longhorn will be updated in-place
01:01:13.288 STDOUT tofu:   ~ resource "helm_release" "longhorn" {
01:01:13.288 STDOUT tofu:       ~ id                         = "longhorn" -> (known after apply)
01:01:13.288 STDOUT tofu:       ~ metadata                   = {
01:01:13.288 STDOUT tofu:           ~ app_version    = "v1.9.1" -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ chart          = "longhorn" -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ first_deployed = 1758162967 -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ last_deployed  = 1758162967 -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ name           = "longhorn" -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ namespace      = "longhorn-system" -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ revision       = 1 -> (known after apply)
01:01:13.288 STDOUT tofu:           ~ values         = jsonencode(
01:01:13.288 STDOUT tofu:                 {
01:01:13.288 STDOUT tofu:                   - defaultBackupStore = {
01:01:13.288 STDOUT tofu:                       - backupTarget                 = "s3://longhorn@us-east-1/"
01:01:13.288 STDOUT tofu:                       - backupTargetCredentialSecret = "longhorn-secrets"
01:01:13.289 STDOUT tofu:                     }
01:01:13.289 STDOUT tofu:                   - longhornUI         = {
01:01:13.289 STDOUT tofu:                       - replicas = 1
01:01:13.289 STDOUT tofu:                     }
01:01:13.289 STDOUT tofu:                 }
01:01:13.289 STDOUT tofu:             ) -> (known after apply)
01:01:13.289 STDOUT tofu:           ~ version        = "1.9.1" -> (known after apply)
01:01:13.289 STDOUT tofu:         } -> (known after apply)
01:01:13.289 STDOUT tofu:         name                       = "longhorn"
01:01:13.289 STDOUT tofu:       ~ values                     = [
01:01:13.289 STDOUT tofu:           - <<-EOT
01:01:13.289 STDOUT tofu:                 "defaultBackupStore":
01:01:13.289 STDOUT tofu:                   "backupTarget": "s3://longhorn@us-east-1/"
01:01:13.289 STDOUT tofu:                   "backupTargetCredentialSecret": "longhorn-secrets"
01:01:13.289 STDOUT tofu:                 "longhornUI":
01:01:13.289 STDOUT tofu:                   "replicas": 1
01:01:13.289 STDOUT tofu:             EOT,
01:01:13.289 STDOUT tofu:           + <<-EOT
01:01:13.289 STDOUT tofu:                 "defaultBackupStore":
01:01:13.289 STDOUT tofu:                   "backupTarget": "s3://longhorn@us-east-1/"
01:01:13.289 STDOUT tofu:                   "backupTargetCredentialSecret": "longhorn-secrets"
01:01:13.289 STDOUT tofu:                 "defaultSettings":
01:01:13.289 STDOUT tofu:                   "systemManagedComponentsNodeSelector": "!node-role.kubernetes.io/master"
01:01:13.289 STDOUT tofu:                 "longhornUI":
01:01:13.289 STDOUT tofu:                   "replicas": 1
01:01:13.289 STDOUT tofu:                 "persistence":
01:01:13.289 STDOUT tofu:                   "defaultClassReplicaCount": 2
01:01:13.289 STDOUT tofu:             EOT,
01:01:13.289 STDOUT tofu:         ]
01:01:13.289 STDOUT tofu:       ~ version                    = "1.9.1" -> "1.10.0"
01:01:13.289 STDOUT tofu:         # (25 unchanged attributes hidden)
01:01:13.289 STDOUT tofu:     }
01:01:13.289 STDOUT tofu: Plan: 0 to add, 1 to change, 0 to destroy.
01:01:13.289 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Flonghorn%252Fterragrunt_kubernetes_longhorn)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/longhorn -w terragrunt_kubernetes_longhorn
  ```
Plan: 0 to add, 1 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```